var vopros = ["Илья учится в 8-м классе. Ему 14 лет. В период каникул решил пойти работать на завод. Его мать возражает, так как считает, что перед новым учебным годом сын должен отдохнуть. Будет ли Илья принят на работу?",
            "В отдел кадров кондитерской фабрики обратился 13-летний Андрей. Он подал заявление с просьбой принять его работу в свободное от учебы время. Родители Андрея согласны, чтобы их сын работал. Будет ли Андрей принят на работу?",

    		"Андрей по телефону известил 1 сентября администрацию фабрики о своем намерении прекратить трудовой договор. В разговоре он сказал, что просит расторгнуть с ним трудовой договор с 5 сентября, так как в этот день он должен приступить к работе на новом месте. 5 сентября Андрей не вышел на работу. Правомерны ли действия Андрея?",

    		"Старший брат 16-летней Ольги работает в казино, предложил Ольге устроить ее на работу в качестве уборщицы игрового зала. Может ли администрация казино заключить с Ольгой трудовой договор?",

    		"Несовершеннолетний Олег был уволен по инициативе администрации. Согласие государственной инспекции труда было получено. Можно ли признать такое увольнение правомерным?"
    		];

var otvet = ["Нет, так как несовершеннолетние в возрасте 14 лет могут работать только с согласия родителей и органа опеки и попечительства",

            "Нет, так как заключать трудовой договор с лицамим, не достигшими 14 лет, возможно только в организациях кинематографии, цирка, театра и т.д. для участия в создании или исполнении произведений и только с согласия родителя и органа опеки и попечительства.",

            "Нет, неправомерны. Андрей должен был уведомить администрацию письменно как того требует закон, и отработать двухдневный срок. В данном случае администрация имеет право уволить его за прогул без уважительной причины.",

            "Нет, т.к использовать труд несовершеннолетнихв в таких местах запрещено.",

            "Нет, т.к несовершеннолетние работники могут быть уволены только с разрешения двух органов- гос. инспекцией труда и комиссии по делам несовершеннолетних"];

var lol = ["0 правильных ответов!",
           
           "20% правильных ответов!",
           
           "40% правильных ответов!",
           
           "60% правильных ответов!",
           
           "80% правильных ответов!",
           
           "100% правильных ответов!"];

var z = 0;

var l = 0;

function not() {
    var elem = document.getElementById('title1');
    elem.style.visibility = 'hidden';
    l=0;
    z=0;
    var n = document.getElementById("q");
    var h = n.textContent;
    n.innerHTML = (vopros[z]);
}

function show(state) {

    document.getElementById('window').style.display = state;
    document.getElementById('wrap').style.display = state;

}

function jsy() {
    z++;
    var n = document.getElementById("q");
    var h = n.textContent;
    var p = document.getElementById("otvet");
    var mybr = document.createElement('br');

    for (i = 0; i <= 4; i++) {
        if (h == vopros[i])
            p.innerHTML = (otvet[i]);
    }
    show('flex');

    n.innerHTML = (vopros[z]);
    if (z == 5) {
        show('flex');
        p.innerHTML = (otvet[z-1]+"<br>"+"<br>"+lol[l]);
        var elem = document.getElementById('title1');
        elem.style.visibility = 'visible';
        
    }
}

function jsn() {
    z++;
    var n = document.getElementById("q");
    var h = n.textContent;
    var p = document.getElementById("otvet");
    n.innerHTML = (vopros[z]);
    l++;
    if (h == vopros[4]) {
        show('flex');
        p.innerHTML = (lol[l]);
        var elem = document.getElementById('title1');
        elem.style.visibility = 'visible';
    }
    n.className = 'h2';

    function func() {
        n.className = 'h1';
    }
    setTimeout(func, 100);
    

}
