function none() {
    document.getElementById('title').style.visibility = "hidden";
}


function otvet() {
    document.getElementsByClassName('button')[0].style.display = "flex";
    $('.otv')[0].style.display = "none";
    
    document.getElementsByClassName('vopr')[0].innerHTML = o[i][j];
    
}


var i;
var j;
var ball = 0;
var otv = 0;

function no() {
    
    document.getElementsByClassName('vopr')[0].style.display = "none";
    document.getElementById('table').style.visibility = "visible";
    document.getElementsByClassName('img')[0].style.display = "none";
    document.getElementsByClassName('button')[0].style.display = "none";
    
    switch (j) {
        case 1:
            ball -= 100;
            break;
        case 2:
            ball -= 100;
            break;
        case 3:
            ball -= 100;
            break;
        case 4:
            ball -= 100;
            break;
        case 5:
            ball -= 100;
            break;
    }
    
    document.getElementsByClassName('ball')[0].innerHTML = ball;
        if (otv == 46) {
            document.getElementsByClassName('end')[0].style.display = "flex";
            document.getElementsByClassName('endp')[0].innerHTML = ('Поздравляем! Квест окончен! </br> Количество набранных баллов равно ' + ball);
        }
}

function yes() {
    document.getElementsByClassName('vopr')[0].style.display = "none";
    document.getElementsByClassName('img')[0].style.display = "none";
    document.getElementsByClassName('button')[0].style.display = "none";
    document.getElementById('table').style.visibility = "visible";
    switch (j) {
        case 1:
            ball += 100;
            break;
        case 2:
            ball += 100;
            break;
        case 3:
            ball += 100;
            break;
        case 4:
            ball += 100;
            break;
        case 5:
            ball += 100;
            break;
    }
    document.getElementsByClassName('ball')[0].innerHTML = ball;
        if (otv == 46) {
            document.getElementsByClassName('end')[0].style.display = "flex";
            document.getElementsByClassName('endp')[0].innerHTML = ('Поздравляем! Квест окончен! </br> Количество набранных баллов равно ' + ball);
        }
}

function img(num) {
    document.getElementsByClassName('img')[0].style.display = "flex";
    var imgn = ('url(img/' + num + '.jpg)');
    document.getElementsByClassName('img')[0].style.backgroundImage = imgn;
    document.getElementsByClassName('img')[0].style.backgroundSize = "50%";
}

$('.end').click(function () {
    location.reload();
});


$(function () {
    $('td').on('click', function () {
        var $td = $(this),
            $tr = $td.parent();

        document.getElementsByClassName('vopr')[0].style.display = "flex";
        $('.otv')[0].style.display = "flex";
        document.getElementById('table').style.visibility = "hidden";
        
otv++;
        i = $tr.index();
        j = $td.index();
        
        document.getElementsByClassName('vopr')[0].innerHTML = question[i][j];

        document.getElementById('table').rows[$tr.index()].cells[$td.index()].innerHTML = '';
    });
});

var question = [
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
     ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"]
    
];

var o = [
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
     ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"],
    ["1", "2", "3", "4", "5"]
];


question[0][1] = "В каком году была принята «Декларация о правах ребенка?» ";
question[0][2] = "Когда была принята действующая КРФ?";
question[0][3] = "В каком году принята «Конвенция о правах ребенка»? Сколько в ней статей?               ";
question[0][4] = "Когда отмечается День прав человека? ";
question[0][5] = "";



question[1][1] = "Как фамилия этого человека? Его должность? ";
question[1][2] = "Назовите кто изображен на фото и какую должность занимал с 2000 года по 2008 год? ";
question[1][3] = "Какую политическую партию возглавляет человек изображенный на фото?";
question[1][4] = "17 февраля 1598 г. Земским собором на русский престол  после смерти царя Федора Иоанновича избирается в цари его шурин? ";
question[1][5] = "";



question[2][1] = "Лицо, имеющее по закону или в силу обычая, право участвовать в выборе представителей целой нации или отдельной общественной группы";
question[2][2] = "Документ для голосования с фамилиями кандидатов";
question[2][3] = "Древнерусское слово, которое означает народное собрание, сход с целью совещания.";
question[2][4] = "";
question[2][5] = "";



question[3][1] = "Высший руководящий орган  политической партии";
question[3][2] = "Сколько представителей от каждой политической партии может быть назначено в избирательную комиссию?";
question[3][3] = "Сколько политическая партия, выдвинувшая кандидата на должность Президента Российской Федерации вправе назначить доверенных лиц?";
question[3][4] = "";
question[3][5] = "";



question[4][1] = "Необходимо назвать,  где прописаны права и обязанности школьников";
question[4][2] = "Какую обязанность несут несовершеннолетние  обучающиеся мужского пола";
question[4][3] = "С какого возраста дети могут создавать в школе или другом учреждении, где они обучаются, собственные общественные организации?";
question[4][4] = "Перечислите ступени образования";
question[4][5] = "";



question[5][1] = "С какого возраста могут привлечь к уголовной ответственности";
question[5][2] = "До какого возраста не могут привлечь к административной ответственности ";
question[5][3] = "Временные рамки комендантского часа для несовершеннолетнего в летний изимний период";
question[5][4] = "Максимальный срок лишения свободы несовершеннолетних за совершение особо тяжких преступлений?";
question[5][5] = "";


question[6][1] = "Какие работы запрещены несовершеннолетним?";
question[6][2] = "С какого возраста могут принять на работу несовершеннолетних лиц ?";
question[6][3] = "Какой промежуток времени составляет ежегодный оплачиваемый отпуск";
question[6][4] = "Какой временной промежуток охватывает рабочий день несовершеннолетних?";
question[6][5] = "Какая страна является родиной профсоюзов?";



question[7][1] = "Как называется признание лица полностью дееспособным по решению органа опеки и попечительства либо суда по достижении 16-летнего возраста ";
question[7][2] = "Перечислите временные сроки действия паспорта";
question[7][3] = "";
question[7][4] = "";
question[7][5] = "";



question[8][1] = "Основной закон рассматривающий семейное право";
question[8][2] = "Родители в разводе. С какого возраста будут учитывать мнение ребенка о том, с кем ему остаться ";
question[8][3] = "В каком случае невозможно восстановить родительские права ?";
question[8][4] = "Какие два вида наследования существуют в гражданском праве?";
question[8][5] = "";


question[9][1] = "По общему правилу срок испытания при принятии на работу не может превышать ";
question[9][2] = "Трудовой договор может прекратится по инициативе";
question[9][3] = "Лицо может самостоятельно заключать трудовой договор в возрасте?";
question[9][4] = "Срок действия дисциплинарного взыскания?";
question[9][5] = "";



question[10][1] = "Субъектами гражданских отношений являются…?";
question[10][2] = "Правоспособность гражданина утрачивается…?";
question[10][3] = "Признание гражданина недееспособным производится…?";
question[10][4] = "Сделка, по которой одна из сторон должна получить плату или иное встречное представление, является…?";
question[10][5] = "";



question[11][1] = "В какой сказке подтверждается право работающего на справедливое вознаграждение?";
question[11][2] = "Каким правом воспользовалась героиня сказки «Дюймовочка»? ";
question[11][3] = "В какой сказке нарушается право человека владеть своим имуществом?";
question[11][4] = "Героиня каких сказок Воспользовалась правом на свободу мирных собраний?";
question[11][5] = "Герои каких сказок использовали право на жизнь, свободу и личную неприкосновенность? ";





o[0][1]="В 1948 году";
o[0][2]="12 декабря 1993 году";
o[0][3]="в 1989г   54 статьи";
o[0][4]="10 декабря  ";
o[0][5]="";



o[1][1]="Первый президент Российской Федерации Ельцин Б.Н. ";
o[1][2]="Президент России Путин В.В. ";
o[1][3]="«Либерально-демократическую партию России» ";
o[1][4]="Борис Годунов ";
o[1][5]="";



o[2][1]="Избиратель";
o[2][2]="Избирательный бюллетень ";
o[2][3]="Вече";
o[2][4]="";
o[2][5]="";



o[3][1]="Съезд";
o[3][2]="Не более одного";
o[3][3]="До 100 человек";
o[3][4]="";
o[3][5]="";



o[4][1]="Устав школы";
o[4][2]="Воинская обязанность";
o[4][3]="Такое право имеют дети старше 8 лет";
o[4][4]="Дошкольное, начальное, основное общее, среднее (полное), среднее профессиональное, высшее, послевузовское";
o[4][5]="";


o[5][1]="с 16, за особо тяжкие преступления с 14";
o[5][2]="до 16";
o[5][3]="с 22.00 до 6.00 в зимний период, с 23.00 до 6.00( по закону субъекта РФ)";
o[5][4]="10 лет";
o[5][5]="";



o[6][1]="вредное и опасное производство, ночное время, командировки, принесение и передвижения тяжестей, подземные работы, работа причиняющая нравственный вред";
o[6][2]="с 16 лет, в особых случаях –раньше 16 (съемки, театральные постановки и т.п.)";
o[6][3]="28 календарный день";
o[6][4]="с 6.00 и до 22.00";
o[6][5]="Англия";



o[7][1]="эмансипация";
o[7][2]="с 14 до 20, с 20 до  45, с 45 и до конца жизни ";
o[7][3]="";
o[7][4]="";
o[7][5]="";



o[8][1]="Семейный кодекс РФ";
o[8][2]="с 10 лет";
o[8][3]="если ребенок усыновлен ";
o[8][4]="по закону и по наследству";
o[8][5]="";


o[9][1]="3 месяца";
o[9][2]="работодателя, работника";
o[9][3]="16 лет ";
o[9][4]="1 год";
o[9][5]="";






o[10][1]="физические и юридические лица, государство";
o[10][2]="в момент смерти гражданина";
o[10][3]="судом";
o[10][4]="возмездной";
o[10][5]="";


o[11][1]="«Мороз Иванович», «Госпожа Метелица»";
o[11][2]="Правом искать и находить в других странах убежище и защиту от преследований";
o[11][3]="«Золотой ключик, или Приключения Буратино»";
o[11][4]="«Бременские музыканты», «Квартет», «Белоснежка и семь гномов»";
o[11][5]="«Серая шейка», «Красная Шапочка», «Дюймовочка», «Сказка о рыбаке и рыбке»";

