var vopros = ["Первая часть НК РФ вступила в силу с 1 января 1999 года?",
              "Синтетические счета бухгалтерского учета подразумевают собой обобщенную характеристику данных, в которой вся информация представлена развернуто и с  уточнениями.",
    		"Налог на добавленную стоимость – это Федеральный налог.",
    		"Имущество организации не является объектом  бухгалтерского учета.",
    		"Руководитель субъекта малого и среднего предпринимательства не может принять ведение бухгалтерского учета на себя.",
    		"Величина натурального и (или) денежного измерения факта хозяйственной жизни с указанием единиц измерения являются обязательным реквизитом первичного учетного документа.",
    		"Внесение исправлений в кассовые и банковские документы  допускается.",
    		"Формы регистров бухгалтерского учета утверждает руководитель экономического субъекта.",
    		"При передаче имущества в аренду нужно проводить инвентаризацию.",
    		"Обязательное проведение инвентаризации устанавливается федеральными и отраслевыми стандартами.",
    		"Если бухгалтерская (финансовая) отчетность экономического субъекта подлежит обязательному аудиту, он обязан организовать и осуществлять внутренний контроль ведения бухгалтерского учета.",
    		"Забалансовый счет 001 это «Товарно-материальные ценности, принятые на ответственное хранение».",
    		"Холдинговая компания, имеющая дочерние общества, вправе в стандартах устанавливать единые требования, обязательные к применению всеми ее отделениями и обществами в целях составления, в том числе, консолидированной отчетности.",
    		"Правовой механизм регулирования бухгалтерской отчетности основан на сочетании деятельности органов государственной власти.",
    		"В ноябре 2010  года был утвержден План по развитию бухучета и отчетности предприятий в Российской Федерации.",
    		"При увеличении актива в обязательном порядке увеличивается пассив на ту же величину.",
    		"Первичные документы бухгалтерского учета не могут иметь типовую форму.",
    		"К резервам по оценочным обязательствам относится резерв на оплату отпусков.",
    		"Подписи лиц ответственных за соглашение не являются обязательными  реквизитами в первичных документах бухгалтерского учета.",
    		"Основные и производственные фонды относится к активам предприятия.",
              "Максимальная продолжительность выездной налоговой проверки организации составляет  3 месяца.",
              "В соответствии с НК налогоплательщик обязан обеспечивать сохранность данных бухгалтерского учета, необходимых для исчисления и уплаты налогов 4 года.",
              "Размер штрафа за нарушение срока постановки на учет зависит от периода нарушения.20.	Основные и производственные фонды относится к активам предприятия.",
    		];


 

function not(){
 
    
 
    
    
 var elem = document.getElementById('title1');
elem.style.visibility = 'hidden';
}

function show(state) {

    document.getElementById('window').style.display = state;
    document.getElementById('wrap').style.display = state;
}

var i=0;
var m=0;





function jsy() {
    var n = document.getElementById("q");
    var h = n.textContent;
    var p = document.getElementById("people");
    var p1 = document.getElementById("people1");

    
    
    if(i==0 || i==2 || i==5 || i==7 || i==8 || i==9 || i==10 || i==12 || i==13 || i==15 || i== 17 || i== 19 || i==21 || i==22){
        m++; 
    }
    
    
    
    
i++;

n.innerHTML = (vopros[i]);


if (i==23){
       
    
     p.innerHTML = ("");
        p1.innerHTML = ("Вы набрали " + m +  " из 23!!!");        
        show('flex');;
    
    n.innerHTML = (vopros[0]);
         var elem = document.getElementById('title1');
elem.style.visibility = 'visible';
        document.images["img"].src = 'img/smail.jpg';
    
i=0;
m=0;}


 
    
    n.className = 'h2';
    function func() {
    n.className = 'h1';}
    setTimeout(func, 100);
}

function jsn() {
    var p1 = document.getElementById("people1");
       var n = document.getElementById("q");
    var h = n.textContent;
    var p = document.getElementById("people");
        if(i==1 || i==3 || i==4 || i==6 || i==11 || i==14 || i==16 || i==18 || i==20){
        m++; 
    }
    
    
    
    
i++;

n.innerHTML = (vopros[i]);


if (i==23){
       
    
     p.innerHTML = ("");
        p1.innerHTML = ("Вы набрали " + m +" из 23!!!");        
        show('flex');;
    
    n.innerHTML = (vopros[0]);
         var elem = document.getElementById('title1');
elem.style.visibility = 'visible';
        document.images["img"].src = 'img/smail.jpg';
    
i=0;
m=0;}


 
    
    n.className = 'h2';
    function func() {
    n.className = 'h1';}
    setTimeout(func, 100);
}


    